<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 3 changes.</summary>

```diff
# module.vm_minimal_config.proxmox_virtual_environment_vm.vm has changed
+ tailscale_tailnet_key.tailscale_key will be created
! module.block_storage.proxmox_virtual_environment_vm.block_storage will be updated in-place
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 2 to add, 1 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-16T21:34:22Z [(view log)](https://github.com/perchnet/p/actions/runs/17013141802/job/48231822563#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                  = "134"
      + ipv4_addresses      = []
      + ipv6_addresses      = []
      + mac_addresses       = [
          + "BC:24:11:91:47:D2",
        ]
        name                = "vm-debian13-minimal"
        tags                = [
            "terraform",
        ]
        # (25 unchanged attributes hidden)

      ~ disk {
          + path_in_datastore = "vm-134-disk-1"
          ~ size              = 10 -> 8
            # (13 unchanged attributes hidden)
        }
      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "zssd" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-131-disk-0" -> null
          - replicate         = true -> null
          - size              = 1 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.block_storage.proxmox_virtual_environment_vm.block_storage will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "block_storage" {
        id                      = "131"
        name                    = null
        tags                    = []
        # (31 unchanged attributes hidden)

      ~ disk {
          ~ size              = 1 -> 10
            # (14 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "134" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:91:47:D2",
        ] -> (known after apply)
        name                    = "vm-debian13-minimal"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 134 -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-134-disk-1" -> (known after apply)
          ~ size              = 8 -> 10
            # (13 unchanged attributes hidden)
        }
      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = "vm-131-disk-0"
          + replicate         = true
          + size              = 10
          + ssd               = false
            # (1 unchanged attribute hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:91:47:D2" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-61-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->